const hostages = [
    {
        hostageName: 'גלי וזיו ברמן',
        description: 'גלי וזיו ברמן: תאומים בני 26 מקיבוץ כפר עזה. ידועים בקשר האחווה העמוק ביניהם ובמעורבותם בקהילה המקומית.  נחטפו ב-7 באוקטובר 2023 משכונת "הדור הצעיר" בקיבוץ כפר עזה',
        lyrics: `__OPEN__בית א'__CLOSE__\nשני אחים, לב אחד,\nכוח שלא נשבר אף פעם.\nתמיד נתנו, תמיד דאגו,\nגם כשקשה – תמיד שם היו.\n\n__OPEN__פזמון__CLOSE__\nאנחנו מחכים, יודעים שתשובו,\nרואים כבר את האור באופק.\nהדרך הביתה נסללת לכם,\nעוד מעט – תהיו שוב כאן.\n\n__OPEN__בית ב'__CLOSE__\nאין לילה בלי תפילה,\nאין יום בלי אמונה.\nלא נוותר, לא נפחד,\nאיתכם בלב- אתם לא לבד.\n\n__OPEN__בית ג'__CLOSE__\nלב רחב, ידיים נותנות,\nחיוך שמרגיע, מילים מחבקות.\nתמיד רואים את האחר,\nעם טוב שאין לו גבול או סף.\n\n__OPEN__פזמון__CLOSE__\nאנחנו מחכים, יודעים שתשובו,\nרואים כבר את האור באופק.\nהדרך הביתה נסללת לכם,\nעוד מעט – תהיו שוב כאן.\n\n__OPEN__Bridge__CLOSE__\nשמותיכם בלב כל אחד ואחת,\nעם ישראל לא מרפה, לא נשבר.\nגלי וזיו – התאומים של התקווה,\nהביתה תשובו – בקרוב, בקרוב.\n\n__OPEN__פזמון אחרון__CLOSE__\nאנחנו מחכים, יודעים שתשובו,\nהלב פועם, הרגש בטוח.\nעוד רגע אחד – והכול ייגמר,\nתחזרו הביתה, אל חיבוק אוהב.`,
        audioLink: './audio/ziv_and_gali.mp3',
        imageLink: './img/Gali_Ziv.png',
        returned: false,
        returnDate: null
    },
    {
        hostageName: 'רום ברסלבסקי',
        description: 'רום ברסלבסקי: בן 26 מפסגת זאב. שימש כמאבטח בפסטיבל "נובה" בקיבוץ רעים, שם גילה אומץ לב והציל שתי צעירות לפני שנחטף. היה מאבטח במסיבת "נובה" בקיבוץ רעים. במהלך המתקפה, הוא סייע לחלץ אנשים מהתופת, עד שנחטף',
        lyrics: `כשעמד מול מרצחים ארורים\nמצא את הכוחות לעודד את ההורים\nהיה חדור מטרה ולא ויתר\nלהגן ולהציל כמה שיותר\n\nהוא פעל שם בגבורה\nבנחישות, ללא מורא\nיכול היה לברוח, להימלט הרחק,\nאך ליבו בחר להישאר ולחבק.\n\nלקח פצועים למקום מבטחים\nוהכל בשלווה ובחיוכים\n\nכמו שרום נלחם שם על כל אחד\nכך נילחם למענו עכשיו.\n\nנתפלל, נקווה, נזעק למרום\nקל רחום- תחזיר לנו את רום!`,
        audioLink: './audio/rom.mp3',
        imageLink: './img/rom.jpg',
        returned: false,
        returnDate: null

    },
    {
        hostageName: 'עומר שם טוב',
        description: 'עומר שם טוב: בן 22, תושב ישראל. ידוע באהבתו למוזיקה ובכישרונו בנגינה על גיטרה, תמיד מביא שמחה לסובבים אותו.  נחטף ב-7 באוקטובר 2023 במהלך מתקפת הטרור על ישראל. הוא היה במסיבת "נובה" בקיבוץ רעים שבדרום הארץ, יחד עם חבריו האחים איתי ומיה רגב. במהלך המתקפה, עומר ניסה להימלט במכונית, אך נלכד ונחטף לרצועת עזה. לאחר שחרורם של מיה ואיתן הם העידו עליו כי הוא שומר שבת בשבי.ואף הצליח לקבל לידו בקבוק מיץ ענבים ממנו הוא מקדש כל ליל שבת.הם מעידים כי הוא זה שהחזיק אותם בשבי ע"י שיר חיוך ועידוד.',
        lyrics: `הַשָּׁמַיִם נִצְבָּעִים בְּגָוֶן שֶׁל כָּתֹם\nמְעִידִים שֶׁנִּגְמַר לוֹ עוֹד יוֹם\nבַּבַּיִת בִּפְנִים עָרוּךְ הַשֻּׁלְחָן\nלִכְבוֹד שַׁבָּת הַכֹּל כְּבָר מוּכָן\n\nוּכְשֶׁיּוֹרֵד הַלַּיְלָה מְנַצְנְצִים כּוֹכָבִים\nסְבִיב לַשֻּׁלְחָן כֻּלָּנוּ עוֹמְדִים\nאַבָּא אִמָּא גַּם מָיָה וְאֵיתָן\nמְחַכִּים רַק לְךָ שֶׁתָּבוֹא גַּם לְכָאן\n\nוְאַבָּא אוֹחֵז בִּגְבִיעַ מְפֹאָר\nהָרֶגֶשׁ וְהַכְּאֵב הוּא בַּל יְתֹאַר\nוַאֲנַחְנוּ שׁוֹמְעִים אוֹתְךָ מִשָּׁם מִקְדָּשׁ גַּם כֵּן\nוּבְקוֹל זְעָקָה עוֹנִים לְךָ אָמֵן\n\nוְהַבְּרָכָה שֶׁלְּךָ מְקַדֶּשֶׁת אֶת הָעוֹלָם\nפּוֹרֶצֶת, מְרַחֶפֶת, עוֹטֶפֶת אֶת כֻּלָּם\nבְּשֶׁקֶט מַחְרִישׁ זוֹעֶקֶת בְּלִי מִלִּים\nעַם יִשְׂרָאֵל חַי לְעוֹלָמִים\n\nוְכָל אֶחָד מְנַגֵּב לוֹ דִּמְעָה בַּסֵּתֶר\nוְרַק הַבְּרָכָה שֶׁלָּךְ מְמַלְּאָה אֶת הַחֶדֶר\nפּוֹרֶטֶת עַל מֵיתָרִים חֲבוּיִים בַּלְּבָבוֹת\nנוֹתֶנֶת כּוֹחַ וְעָצְמָה אֱמוּנָה וְתִקְווֹת\n\nוְנִשְׁאַר לָנוּ רַק לְהַאֲמִין בַּהַבְטָחָה\nשֶׁ 'קל יִשְׁמְרֵנוּ' וְתָבוֹא עָלָיו בְּרָכָה\nמְבַקְּשִׁים שֶׁשַּׁבָּת הַבָּאָה תִּהְיֶה פֹּה גַּם כֵּן\nוּמַלְאָךְ טוֹב עוֹנֶה 'אָמֵן'\n\nמְחַכִּים לְךָ עֹמֶר\nכָּל הַחֲבֵרִים\n\nמְחַכֶּה גַּם הַפְּסַנְתֵּר\nלִפְתֹּחַ בְּשִׁירִים\n\nמָתַי עֹמֶר נִרְאֶה שׁוּב אֶת הַמַּבָּט?\nבּוֹא בְּשָׁלוֹם, וְנֵצֵא לִקְרַאת שַׁבָּת`,
        audioLink: './audio/omer.mp3',
        imageLink: './img/omer.jpg',
        returned: true,
        returnDate: '22/02/2025'

    },
    {
        hostageName: 'בר קופרשטין',
        description: 'בר קופרשטיין: בן 22, תושב ישראל. סטודנט מצטיין למדעי המחשב, אהוב על חבריו בזכות חוש ההומור והנדיבות שלו. נחטף ב-7 באוקטובר 2023 מקיבוץ רעים שבדרום הארץ. הוא עבד כמאבטח במסיבת "נובה" בקיבוץ, ובמהלך המתקפה נשאר לסייע לפצועים, מה שהוביל לחטיפתו.',
        lyrics: 'נְקִי כַּפַּיִם, בַּר לֵבָב\nלהציל חיים כָּל כֻּלּוֹ נִשְׁאַב\nבְּאֹמֶץ, מְסִירוּת, וְרֶגֶשׁ מְיֻחָד\nנָתַן אֶת כָּל כֻּלּוֹ מִכָּל הַלֵּב לְכָל אֶחָד\n\n\nאֲנַחְנוּ מְחַכִּים, מְחַכִּים שֶׁיַּחְזֹר.\nלִרְאוֹת אֶת הַחִיּוּךְ, הַדְּאָגָה וְהָאוֹר\nהוּא תמיד תמך ועזר\nוַאֲנַחְנוּ בִּשְׁבִילוֹ נַעשה מה שאפשר\n\n\n\nבְּעֶזְרַת הַשֵּׁם, בַּר יַחֲזֹר,\nבָּרִיא וְשָׁלֵם בְּלִי שׁוּם פֶּגַע\nלֹא נְוַתֵּר, לֹא נִשְׁכַּח\nאֶת הַתִּקְוָה לֹא נְאַבֵּד לְרֶגַע\n\n\nאֲנַחְנוּ מְחַכִּים, מְחַכִּים שֶׁיַּחְזֹר.\nלִרְאוֹת אֶת הַחִיּוּךְ, הַדְּאָגָה וְהָאוֹר\nנַמְשִׁיךְ לְהִתְפַּלֵּל, לְהַאֲמִין וּלְקַווֹת\nוּבְקָרוֹב מַמָּשׁ נִרְאֶה יְשׁוּעוֹת',
        audioLink: './audio/bar.mp3',
        imageLink: './img/bar.jpeg',
        returned: false,
        returnDate: null

    },
    {
        hostageName: 'סשה טרופנוב',
        description: 'בן 28, תושב ישראל. מהנדס מכונות מוכשר, מתנדב בקהילה ותורם מזמנו לעזרה לנזקקים. נחטף ב-7 באוקטובר 2023 מביתו שבקיבוץ ניר עוז',
        lyrics: `סָשָׁה שֶׁלָּנוּ, אוֹר שֶׁל כֻּלָּם\nנֶפֶשׁ עֲדִינָה וְלֵב חַם\nדְּמוּת שֶׁל כֹּחַ וְשֶׁל עוֹצְמָהּ\nעִם חִיּוּךְ שֶׁחוֹדֵר לְתוֹךְ הַנְּשָׁמָה\n\nבָּחוּר עִם הַרְבֵּה שְׁאִיפוֹת וְתִקְווֹת\nנוֹגֵעַ בְּהַרְבֵּה לְבָבוֹת\nכָּרִיזְמָטִי וְאָהוּב עַל כֻּלָּם\nמְחוֹנָן, שָׁנוּן וְחָכָם\n\nכֻּלָּנוּ מְחַכִּים וּמְיַחֲלִים\nמְבַקְּשִׁים, בְּכָל הַכּוֹחַ וּמִתְפַּלְּלִים,\nשֶׁתַּחְזֹר בְּשָׁלוֹם בָּרִיא וְאֵיתָן\nבִּזְרוֹעוֹת פְּתוּחוֹת מְחַכִּים לְךָ כָּאן"`,
        audioLink: './audio/sasha.mp3',
        imageLink: './img/sasha.jpg',
        returned: true,
        returnDate: '15/02/2025'

    },
    {
        hostageName: 'יאיר ואיתן הורן',

        description: 'יאיר ואיתן הורן: יאיר בן 46 ואיתן בן 38, תושבי ישראל. אחים קרובים, ידועים באהבתם לטיולים בטבע ובתרומתם לקהילה המקומית. נחטפו ב-7 באוקטובר 2023 מקיבוץ ניר עוז שבדרום הארץ',
        lyrics: `יָאִיר וְאֵיתָן אַחִים קְרוֹבִים\nעַל כֻּלָּם אֲהוּבִים\nיָאִיר כְּמוֹ קֶרֶן אוֹר בָּאֲפֵלָה\nמַשְׁקִיעַ מַאֲמַצִּים לְמַעַן הַקְּהִלָּה,\nהוּא סְטֶנְדְּאַפִּיסְט וְשַׁדְרָן , פָּעִיל וְחָרוּץ\nמֻמְחֵה שִׁפּוּצִים וּמְאַרְגֵּן פְעִילוּיוֹת בַּקִּבּוּץ\n\nאֵיתָן אוֹהֵב לְהוֹפִיעַ וְתָמִיד מַצְחִיק אֶת כֻּלָּם\nבְּכָל מָקוֹם שֶׁהָיָה הִשְׁאִיר חוֹתָם\n.הוּא אוֹהֵב אֶת הַחַיִּים,\nאוֹהֵב לַעֲזֹר, וְלִהְיוֹת עִם חֲבֵרִים\n\nמְחַכִּים לָכֶם כֻּלָּם\nהַמִּשְׁפָּחָה וְכָל הָעָם\nרוֹאִים כְּבָר אֶת הָאוֹר בִּקְצֵה הַמִּנְהָרָה\nוּמִתְפַּלְּלִים שֶׁתָּשׁוּבוּ בִּמְהֵרָה`,
        audioLink: './audio/yair_eitan.mp3',
        imageLink: './img/yair_eitan.jpg',
        returned: true,
        returned2: false,
        returnDate: '15/02/2025',
        returnDate2: null

    },
    {
        hostageName: 'אבינתן אור',
        description: 'אבינתן אור: בן 31 מתל אביב. אמן וצלם מוכשר, שתיעד רגעים מיוחדים והציג בתערוכות רבות. הוא היה במסיבת "נובה" בקיבוץ רעים, שם נחטף יחד עם בת זוגו, נועה ארגמני.',
        lyrics: `אֲבִינָתָן בָּחוּר שֶׁל אוֹר\nאוֹהֵב לָתֵת וְלַעֲזֹר\nמַצְחִיק, חָכָם, מָלֵא נְתִינָה,\nזוֹרֵחַ כְּמוֹ קֶרֶן אוֹר קְטַנָּה.\nבְּלִי רַעַשׁ, בְּלִי צִלְצוּלִים,\nמִתְנַדֵּב אֵצֶל יְלָדִים חוֹלִים\nחָבֵר נֶאֱמָן, מֻקָּף בְּאַהֲבָה,\nמשרה סְבִיבוֹ רַק שַׁלְוָה.\n\nכֻּלָּנוּ מִתְפַּלְּלִים\nמִכָּל הַלֵּב מְיַחֲלִים\nשֶׁמַּהֵר מַהֵר תַּחְזֹר\nוּלְפָנֶיךָ יַחְזֹר שׁוּב הָאוֹר`,
        audioLink: './audio/avinatan.mp3',
        imageLink: './img/avinatan.jpeg',
        returned: false,
        returnDate: null
    },
    {
        hostageName: 'אוהד יהלומי',
        description: 'אוהד יהלומי: בן 50, תושב ישראל. מורה מוערך למתמטיקה, שהשפיע על חייהם של תלמידים רבים בזכות סבלנותו ומסירותו. מתגורר בקיבוץ ניר עוז שבדרום הארץ. ב-7 באוקטובר 2023, במהלך מתקפת הטרור, הוא נחטף יחד עם בנו, איתן בן ה-12, מביתם בקיבוץ',
        lyrics: `אֹהַד אָהוּד עַל כֻּלָּם\nמָלֵא בְּכָרִיזְמָה , אַבָּא מֻשְׁלָם\nשׂוֹחֶה, מְטַיֵּל וְרָץ\nלְכֻלָּם מְסַיֵּעַ, פָּעִיל וְנִמְרָץ\n\nבְּאוֹתוֹ בֹּקֶר שָׁחֹר\nהִתְנַהַגְתָּ כְּגִבּוֹר\nלֹא חָשַׁבְתָּ עַל עַצְמְךָ\nעָשִׂיתָ הַכֹּל לְהַצִּיל אֶת הַמִּשְׁפָּחָה\n\nאֲנַחְנוּ כָּאן, לִבֵּנוּ אִתְּךָ,\nמְחַכִּים לָרֶגַע שֶׁתָּשׁוּב אֶל בֵּיתְךָ.\nמִתְפַּלְּלִים וְהַלֵּב מָלֵא תִּקְוָה\nשֶׁתָּשׁוּב לְחַיִּים שֶׁל שַׁלְוָה`,
        audioLink: './audio/ohad.mp3',
        imageLink: './img/ohad.jpg',
        returned: false,
        returnDate: null

    },
    {
        hostageName: 'אלון אהל ',
        description: 'אלון אהל: בן 23 מהיישוב לבון שבגליל העליון. צעיר מלא חיים, אהוב על חבריו ומשפחתו. נחטף ממסיבת הנובה ב-7 באוקטובר 2023',
        // lyrics: `עִם חִיּוּךְ גָּדוֹל, תָּמִיד הוֹפִיעַ,\nבְּאַהֲבַת הַבְּרִיּוֹת תָּמִיד הִשְׁקִיעַ,\nהָיָה מְעַט בַּיְשָׁן וְנָעִים לְכֻלָּם,\nוְנוֹחַ לַבְּרִיּוֹת כָּל הַזְּמַן,\n\nוּלְהַכְעִיסוֹ כִּמְעַט וְלֹא הָיָה אֶפְשָׁר,\n\nאֶצְבְּעוֹתָיו, נוֹגְעוֹת בַּפְּסַנְתֵּר,\n\nסָבְתָא מִתְגַּעְגַּעַת, לְשִׂיחוֹתֶיךָ הַמְּרַתְּקוֹת,\nוְתָמִיד דְּמָעוֹת בְּעֵינֶיהָ, שֶׁנִּזְכַּרְתָּ בִּדְבָרֶיךָ,\nהַחִיּוּךְ שֶׁלָּךְ, תָּמִיד יִשָּׁאֵר בְּמוֹחָהּ,\nוּמְחַכֶּה כְּבָר לִרְאוֹתְךָ שׁוּב בְּקָרוֹב בִּמְהֵרָה,\n\nאַלּוֹן הַיָּקָר, בְּכָל מַנְגִּינָה שֶׁנִּשְׁמַע,\nנַמְשִׁיךְ אֶת דַּרְכְּךָ, וְאֶת כָּל חֲסָדֶיךָ,\nאַתָּה פֹּה אִתָּנוּ, בְּכָל זִכָּרוֹן,\nתָּמִיד תִּהְיֶה חֵלֶק, מִלִּבֵּנוּ וּתְפִלּוֹתֵינוּ.\n\nאַלּוֹן מְחַכִּים לְשׁוּבְךָ - שֶׁיִּהְיֶה בְּקָרוֹב אָמֵן\n\nצְלִילִים מִתְנַגְּנִים שִׁירִים קְסוּמִים הוֹצִיא תַּחַת יָדָיו,\nמֵאָז כִּתָּה ד', עַל הַפְּסַנְתֵּר תָּמִיד הָיְתָה מַנְגִּינָה,\nהוּא נִגֵּן עִם כָּל הַלֵּב, כָּל תָּו בַּיִת וּפִזְמוֹן בְּלִי הַפְסָקָה,\n\nחֲבֵרִים קְרוֹבִים, תָּמִיד בָּא כֻּלָּם נִהְיוּ עִם חִיּוּךְ,\nהָיָה מַקְשִׁיב לְכָל אֶחָד וְאֶחָד,\nתּוֹמֵךְ, מֵאִיר, וְכָל זֹאת בְּחֹם וּבְאַהֲבָה,\nכְּמוֹ עֵץ אַלּוֹן חָסוֹן הִשְׁפִּיעַ לַסְּבִיבָה,\n\nאַךְ בִּשְׁבִיעִי בְּאוֹקְטוֹבֶּר הַכֹּל הִשְׁתַּנָּה,\nהַיְּרִיּוֹת וְהַבֶּהָלָה, כְּמוֹ סוּפָה גְּדוֹלָה,\nאַלּוֹן נִלְחַם, כְּדֵי לְהַצִּיל אֶת חַיֵּי חֲבֵרָיו,\nוְאַף הֵבִין שֶׁיָּכוֹל לְשַׁלֵּם עַל כָּךְ בְּחַיָּיו,\nוּמֵאָז כֻּלָּנוּ מְחַכִּים מָתַי תַּחֲזֹר כְּבָר - אַלּוֹן`,
        lyrics: "עִם חִיּוּךְ גָּדוֹל, תָּמִיד הוֹפִיעַ\nבְּאַהֲבַת הַבְּרִיּוֹת תָּמִיד הִשְׁקִיעַ\nהָיָה מְעַט בַּיְשָׁן וְנָעִים לְכֻלָּם\nוְנוֹחַ לַבְּרִיּוֹת כָּל הַזְּמַן\nוּלְהַכְעִיסוֹ כִּמְעַט וְלֹא הָיָה אֶפְשָׁר\n\nאֶצְבְּעוֹתָיו, נוֹגְעוֹת בַּפְּסַנְתֵּר\nצְלִילִים מִתְנַגְּנִים שִׁירִים קְסוּמִים הוֹצִיא תַּחַת יָדָיו\nמֵאָז כִּתָּה ד', עַל הַפְּסַנְתֵּר תָּמִיד הָיְתָה מַנְגִּינָה\nהוּא נִגֵּן עִם כָּל הַלֵּב, כָּל תָּו בַּיִת וּפִזְמוֹן בְּלִי הַפְסָקָה\n\nחֲבֵרִים קְרוֹבִים, תָּמִיד בָּא כֻּלָּם נִהְיוּ עִם חִיּוּךְ\nהָיָה מַקְשִׁיב לְכָל אֶחָד וְאֶחָד\nתּוֹמֵךְ, מֵאִיר, וְכָל זֹאת בְּחֹם וּבְאַהֲבָה\nכְּמוֹ עֵץ אַלּוֹן חָסוֹן הִשְׁפִּיעַ לַסְּבִיבָה\n\nאַךְ בִּשְׁבִיעִי בְּאוֹקְטוֹבֶּר הַכֹּל הִשְׁתַּנָּה\nהַיְּרִיּוֹת וְהַבֶּהָלָה, כְּמוֹ סוּפָה גְּדוֹלָה\nאַלּוֹן נִלְחַם, כְּדֵי לְהַצִּיל אֶת חַיֵּי חֲבֵרָיו\nוְאַף הֵבִין שֶׁיָּכוֹל לְשַׁלֵּם עַל כָּךְ בְּחַיָּיו\nוּמֵאָז כֻּלָּנוּ מְחַכִּים מָתַי תַּחֲזֹר כְּבָר - אַלּוֹן\n\nסָבְתָא מִתְגַּעְגַּעַת, לְשִׂיחוֹתֶיךָ הַמְּרַתְּקוֹת\nוְתָמִיד דְּמָעוֹת בְּעֵינֶיהָ, שֶׁנִּזְכַּרְתָּ בִּדְבָרֶיךָ\nהַחִיּוּךְ שֶׁלָּךְ, תָּמִיד יִשָּׁאֵר בְּמוֹחָהּ\nוּמְחַכֶּה כְּבָר לִרְאוֹתְךָ שׁוּב בְּקָרוֹב בִּמְהֵרָה\n\nאַלּוֹן הַיָּקָר, בְּכָל מַנְגִּינָה שֶׁנִּשְׁמַע\nנַמְשִׁיךְ אֶת דַּרְכְּךָ, וְאֶת כָּל חֲסָדֶיךָ\nאַתָּה פֹּה אִתָּנוּ, בְּכָל זִכָּרוֹן\nתָּמִיד תִּהְיֶה חֵלֶק, מִלִּבֵּנוּ וּתְפִלּוֹתֵינוּ\nאַלּוֹן מְחַכִּים לְשׁוּבְךָ - שֶׁיִּהְיֶה בְּקָרוֹב אָמֵן",
        audioLink: './audio/alon.mp3',
        imageLink: './img/alon.jpg',
        returned: false,
        returnDate: null

    },
    {
        hostageName: 'איתן מור',
        description: 'איתן מור, בן 23 מקריית ארבע, נחטף ב-7 באוקטובר 2023 בעת שעבד כמאבטח בפסטיבל הנובה בקיבוץ רעים. הוא ידוע כאדם חייכן, מלא שמחת חיים ואהוב על משפחתו וחבריו. לפני שנחטף, הביע בפני משפחתו את רצונו שלא ישחררו אותו תמורת מחבלים. משפחתו מכבדת את בקשתו ופועלת לשחרורו בדרכים אחרות.',
        lyrics: `אֵיתָן בָּחוּר חַיְיכָן וּמַרְשִׁים
זָכָה לְסַיֵּעַ וּלְהַצִּיל חַיִּים
בִּמְקוֹם לָנוּס מִמִתְקֶפֶת הַמְּחַבְּלִים
נִשְׁאַר לְהָגֵן עַל הַפְּצוּעִים וְהַמֵּתִים

תָּמִיד חָשַׁב עַל כוּלָּם
עֲבוּר בֵּית כְּנֶסֶת סְכוּם גָּדוֹל תָּרַם
לִפְנֵי שֶׁנֶּחְטַף אָמַר לְמִשְׁפַּחְתּוֹ
שֶׁלֹּא יְשַׁחְרְרוּ מְחַבְּלִים תְמוּרָתוֹ

תַּמְשִׁיךְ לִהְיוֹת אֵיתָן וְגִבּוֹר
עוֹד מְעַט אַתָּה תַּחֲזֹר
כֻּלָּנוּ כָּאן הָעָם וְהַמִּשְׁפָּחָה
מִתְפַּלְּלִים, מְיַיחֲלִים לְשּׁוּבְךָ`,
        audioLink: './audio/eitan.mp3',
        imageLink: './img/eitan.jpg',
        returned: false,
        returnDate: null

    },
    {
        hostageName: 'תמיר נמרודי',
        description: "תמיר נמרודי, בן 20, שירת כמש''ק חינוך במפקדת התיאום והקישור עזה. הוא נחטף ב-7 באוקטובר 2023 מבסיסו בעוטף עזה, זמן קצר לפני יום הולדתו ה-19. תמיר ידוע ברצונו העז לעזור לאחרים, ובמשפחתו מתארים אותו כ'ילד מדהים עם רצון לשנות משהו בעולם'. ",
        // lyrics: ` __OPEN__בית א'__CLOSE__\nתָּמִיר, יֶלֶד שֶׁל אוֹר,\nנֶחְטַף בְּיוֹם שָׁחֹר.\nלִבֵּנוּ שָׁבוּר, כָּאוּב,\nאַךְ אָנוּ מַאֲמִינִים, יוֹדְעִים, אַתָּה תָּשׁוּב.\n\n__OPEN__בית ב'__CLOSE__\nבֶּן תְּשַׁע עֶשְׂרֵה, מַשָּׁ''ק חִנּוּךְ,\nאוֹהֵב לַעֲזֹר, לְחַבֵּר, לִתְמֹךְ.\n\'מַעְגָּל חֶבְרָתִי קָרוֹב\', כָּךְ כָּתַב,\n\'לֹא לִפְגֹּעַ\', זֶה הָיָה עֵרֶךְ נִשְׂגָּב.\n\n__OPEN__פזמון__CLOSE__\nתָּמִיר, תָּמִיר, אָנָּא חֲזֹר,\nמִשְׁפָּחָה מְחַכָּה, לְךָ, גִּבּוֹר.\nעִם חִיּוּךְ, וְדִמְעָה,\nנְחַבֵּק אוֹתְךָ, מִשְׁפָּחָה שְׁלֵמָה.\n\n__OPEN__בית ג'__CLOSE__\nאַהֲבָתְךָ, חֹם לִבְּךָ שֶׁזּוֹרֵחַ,\nנוֹתְנִים לָנוּ כּוֹחַ.\nזוֹכְרִים אֶת הַטּוֹב שֶׁבְּךָ,\nאֶת הָאוֹר הַשּׁוֹפֵעַ מִלִּבְּךָ.\n\n__OPEN__בית ד'__CLOSE__\nחִיּוּךְ נָדִיב, לֵב רַחוּם,\nתָּמִיד רוֹצֶה לִתְרֹם.\nחוֹלֵם עַל עוֹלָם טוֹב יוֹתֵר,\nבּוֹ כֻּלָּם חַיִּים יַחַד, בְּאֹשֶׁר.\n\n__OPEN__פזמון__CLOSE__\nתָּמִיר, תָּמִיר, אָנָּא חֲזֹר,\nמִשְׁפָּחָה מְחַכָּה, לְךָ, גִּבּוֹר.\nעִם חִיּוּךְ, וְדִמְעָה,\nנְחַבֵּק אוֹתְךָ, מִשְׁפָּחָה שְׁלֵמָה.\n\n__OPEN__Bridge__CLOSE__\nתָּמִיר, מַלְאָךְ שֶׁלָּנוּ,\nאָנוּ מִתְפַּלְּלִים לְשׁוּבְךָ.\nיַחַד נְחַזֵּק אֶת לִבֵּנוּ,\nנַחֲזִיר אוֹתְךָ, גִּבּוֹר, אֵלֵינוּ.\n\n__OPEN__פזמון-סיום__CLOSE__\nתָּמִיר, תָּמִיר, גִּבּוֹר,\nמְחַכִּים, מְחַכִּים לְךָ, חֲזֹר.\nעִם דְּמָעוֹת שֶׁל שִׂמְחָה,\nנְחַבֵּק אוֹתְךָ, כָּל הַמִּשְׁפָּחָה,\nמִשְׁפָּחָה שֶׁהִתְגַּלְּתָה- עַם שָׁלֵם שֶׁמְּחַכֶּה לְשׁוּבְךָ.`,
        lyrics: `בית 1
תָּמִיר, יֶלֶד שֶׁל שִׂמְחָה וְאוֹר.
נֶחְטַף בְּאוֹתוֹ יוֹם רַע וְשָׁחוֹר.
וּמֵאָז, לִיבֵּנוּ, שָׁבוּר, גַּם כָּאוּב.
אֲבָל אָנוּ מַאֲמִינִים, שֶׁאֵלֵינוּ עוֹד תָּשׁוּב.

בית 2
אִישׁ צָעִיר, מַשָּׁק חִנּוּךְ נֶאֱהָב.
שֶׁעוֹזֵר, תּוֹמֵךְ, דּוֹאֵג לְחַבֵּר בְּכָל מַצָּב.
מַעֲגָּל חֶבְרָתִי קָרוֹב, כָּךְ גַּם כָּתַב.
לֹא לִפְגֹּעַ, זֶה אֶצְלוֹ, עֵרֶךְ נִשְׂגָּב.

פזמון 1
תָּמִיר, תָּמִיר, אָדָם גִּיבּוֹר.
כֻּלָּנוּ מְחַכִּים שֶׁכְּבָר תַּחזוֹר.
עִם חִיּוּךְ, אוּלַי דִמְעָה.
כִּי רַק אִיתְּךָ כֻּלָּנוּ יַחַד, מִשְׁפָּחָה שְׁלֵמָה.

בית 3
אַהֲבָתְךָ, טוּב לִבְּךָ שֶׁזוֹרֵחַ
נוֹתְנִים לָנוּ עַכְשָׁיו אֶת הכּוֹחַ.
זוֹכְרִים אֶת הַיּוֹפִי, שֶׁבֶּךָ קַיָּם.
אֶת הָאוֹר הַשּׁוֹפֵעַ, שֶׁלֹּא כָּבֶה לְעוֹלָם.

בית 4
עִם חִיּוּךְ נָדִיב, לֵב רַחוּם וְחַם.
בְּכֹל הִזְדַּמְּנוּת, מְחַפֵּשׂ, לִתְרוֹם לְכוּלָּם.
חוֹלֵם עַל עוֹלָם, עוֹד יוֹתֵר טוֹב.
בּוֹ כּוּלָּנוּ חַיִּים, יַחַד קָרוֹב.

גשר
תָּמִיר, תָּמִיר, מַלְאָךְ שֶׁלָּנוּ.
מַרְגִּישִׁים אוֹתְךָ תָּמִיד, עָמֹק בְּלִבֵּנוּ.
מְחוּזָּקִים, מְאוּחָדִים בְּתוֹכֵנוּ.
סוֹפְרִים אֶת דִּמְעוֹתֵינוּ.
מְרִימִים יַחַד אֶת עֵינֵנוּ.
מַשְׁמִיעִים אֶת קוֹלֵנוּ.
מֵחַזְקִים, אֶת כֹּל אַחֵינוּ.
וּמִתְפַּלֵלִים שֶׁתַּחזוֹר אֵלֵינוּ.

פזמון 2
תָּמִיר, תָּמִיר, אַתָּה גִּיבּוֹר.
מְחַכִּים, מְחַכִּים לְךָ, חֲזוֹר.
עִם דּמָעוֹת שֶׁל שִׂמְחָה.
נְחַבֵּק אוֹתְךָ, כֹּל הַמִּשְׁפָּחָה.

מִשְׁפָּחָה שֶׁהִתְגַּלְּתָה.
עַם שָׁלֵם, שֶׁמֶּחַכֶּה, לְשׁוּבְךָ.`,
        audioLink: './audio/tamir.mp3',
        imageLink: './img/tamir.jpeg',
        returned: false,
        returnDate: null

    },
    {
        hostageName: 'שגיא דקל חן',
        description: 'שגיא דקל חן: בן 36, תושב ישראל. יזם בתחום הטכנולוגיה, ידוע ביצירתיות שלו ובנכונותו לסייע לאחרים.  תושב קיבוץ ניר עוז שבדרום הארץ, נחטף ב-7 באוקטובר 2023 במהלך מתקפת הטרור על ישראל. הוא היה בין הראשונים שזיהו את חדירת המחבלים, נלחם בהם עד שנחטף לעזה.',
        lyrics: `את ידי הזהב\nאת הלב הרחב\nאין מי שסביבך לא הכיר\n\nהנתינה לעולם\nהדאגה לכולם\nועכשיו אתה פוסטר על קיר\n\nפזמון א:\nבאותו בוקר שחור\nהיית, כמו תמיד, הגיבור\nהצלת את משפחתך\nלא חשבת על עצמך\n\nמבקשים, מתפללים שתחזור\nרוצים לראות שוב את האור\nשתמיד בוקע מליבך\nלשמוע שוב את צחוקך\n\nהאם אתה יודע\nששחר נולדה?\nהיא כבר חוגגת שנה\n\nלהכיר את אבא\nהיא כה מחכה\nואיתה מתפללת כל האומה\n\nפזמון ב:\nומאותו בוקר שחור\nבלב של כולנו יש חור\nמצפים כל כך לשובך\nמייחלים לראות אותך\n\nמבקשים, מתפללים שתחזור\nרוצים לראות שוב את האור\nשתמיד בוקע מליבך\nלשמוע שוב את צחוקך`,
        // lyrics:"עִם חִיּוּךְ גָּדוֹל, תָּמִיד הוֹפִיעַ\nבְּאַהֲבַת הַבְּרִיּוֹת תָּמִיד הִשְׁקִיעַ\nהָיָה מְעַט בַּיְשָׁן וְנָעִים לְכֻלָּם\nוְנוֹחַ לַבְּרִיּוֹת כָּל הַזְּמַן\nוּלְהַכְעִיסוֹ כִּמְעַט וְלֹא הָיָה אֶפְשָׁר\n\nאֶצְבְּעוֹתָיו, נוֹגְעוֹת בַּפְּסַנְתֵּר\nצְלִילִים מִתְנַגְּנִים שִׁירִים קְסוּמִים הוֹצִיא תַּחַת יָדָיו\nמֵאָז כִּתָּה ד', עַל הַפְּסַנְתֵּר תָּמִיד הָיְתָה מַנְגִּינָה\nהוּא נִגֵּן עִם כָּל הַלֵּב, כָּל תָּו בַּיִת וּפִזְמוֹן בְּלִי הַפְסָקָה\n\nחֲבֵרִים קְרוֹבִים, תָּמִיד בָּא כֻּלָּם נִהְיוּ עִם חִיּוּךְ\nהָיָה מַקְשִׁיב לְכָל אֶחָד וְאֶחָד\nתּוֹמֵךְ, מֵאִיר, וְכָל זֹאת בְּחֹם וּבְאַהֲבָה\nכְּמוֹ עֵץ אַלּוֹן חָסוֹן הִשְׁפִּיעַ לַסְּבִיבָה\n\nאַךְ בִּשְׁבִיעִי בְּאוֹקְטוֹבֶּר הַכֹּל הִשְׁתַּנָּה\nהַיְּרִיּוֹת וְהַבֶּהָלָה, כְּמוֹ סוּפָה גְּדוֹלָה\nאַלּוֹן נִלְחַם, כְּדֵי לְהַצִּיל אֶת חַיֵּי חֲבֵרָיו\nוְאַף הֵבִין שֶׁיָּכוֹל לְשַׁלֵּם עַל כָּךְ בְּחַיָּיו\nוּמֵאָז כֻּלָּנוּ מְחַכִּים מָתַי תַּחֲזֹר כְּבָר - אַלּוֹן\n\nסָבְתָא מִתְגַּעְגַּעַת, לְשִׂיחוֹתֶיךָ הַמְּרַתְּקוֹת\nוְתָמִיד דְּמָעוֹת בְּעֵינֶיהָ, שֶׁנִּזְכַּרְתָּ בִּדְבָרֶיךָ\nהַחִיּוּךְ שֶׁלָּךְ, תָּמִיד יִשָּׁאֵר בְּמוֹחָהּ\nוּמְחַכֶּה כְּבָר לִרְאוֹתְךָ שׁוּב בְּקָרוֹב בִּמְהֵרָה\n\nאַלּוֹן הַיָּקָר, בְּכָל מַנְגִּינָה שֶׁנִּשְׁמַע\nנַמְשִׁיךְ אֶת דַּרְכְּךָ, וְאֶת כָּל חֲסָדֶיךָ\nאַתָּה פֹּה אִתָּנוּ, בְּכָל זִכָּרוֹן\nתָּמִיד תִּהְיֶה חֵלֶק, מִלִּבֵּנוּ וּתְפִלּוֹתֵינוּ\nאַלּוֹן מְחַכִּים לְשׁוּבְךָ - שֶׁיִּהְיֶה בְּקָרוֹב אָמֵן",
        audioLink: './audio/sagi.mp3',
        imageLink: './img/sagi2.jpg',
        returned: true,
        returnDate: '15/02/2025'
    },
    {
        hostageName: 'שגב כלפון',
        description: 'שגב כלפון, בן 27 מדימונה, נחטף ב-7 באוקטובר 2024 במהלך מתקפת הטרור על פסטיבל הנובה בסמוך לקיבוץ רעים. הוא בן אמצעי במשפחתו, עם אח גדול ואחות קטנה. שגב עבד במאפייה המשפחתית ובמקביל החל בלימודים בתחום שוק ההון. חבריו ובני משפחתו מתארים אותו כאדם בעל לב רחב, אהוב ומצחיק, שתמיד שאף ליהנות מהחיים. לאחרונה, קיבלה משפחתו אות חיים ממנו באמצעות חטוף ששוחרר, שהעיד כי שגב חי ומצבו הבריאותי תקין.',
        // description: 'שגיא דקל חן: בן 36, תושב ישראל. יזם בתחום הטכנולוגיה, ידוע ביצירתיות שלו ובנכונותו לסייע לאחרים.  תושב קיבוץ ניר עוז שבדרום הארץ, נחטף ב-7 באוקטובר 2023 במהלך מתקפת הטרור על ישראל. הוא היה בין הראשונים שזיהו את חדירת המחבלים, נלחם בהם עד שנחטף לעזה.',
        lyrics: `שֶׂגֶב בָּחוּר צָנוּעַ, בַּיְשָׁן וְעָנָו
עִם חוּשׁ הוּמוֹר וְלֵב רָחָב
יֵשׁ לוֹ הַרְבֵּה שְׁאִיפוֹת וַחֲלוֹמוֹת
חוֹתֵר לְלֹא לֵאוּת לְהַשִּׂיג אֶת הַמַּטָּרוֹת
שֶׂגֶב עָבַד בַּמַּאֲפִיָּה הַמִּשְׁפַּחְתִּית
וּבְשׁוּק הַהוֹן מְפַתֵּחַ קַרְיֵרָה עַצְמָאִית

אֲנַחְנוּ מְחַכִּים, יוֹדְעִים שֶׁתַּחְזֹר
רוֹאִים כְּבָר בָּאֹפֶק אֶת הָאוֹר
כֻּלָּנוּ כָּאן עָלֶיךָ מִתְפַּלְּלִים
לְשׁוּבְךָ בְּשָׁלוֹם מְיַחֲלִים`,
        audioLink: './audio/segev.mp3',
        imageLink: './img/segev.jpeg',
        returned: false,
        returnDate: '15/02/2025'
    },
    {
        hostageName: 'כפיר ואריאל ביבס',
        description: 'כפיר ואריאל ביבס: כפיר בן 2 ואריאל בן 5, תושבי ישראל. ילדים מלאי שמחה, שהביאו אור ואושר למשפחתם ולסובבים אותם. נחטפו יחד עם אמם, שירי ביבס, במהלך מתקפת ה-7 באוקטובר 2023.',
        lyrics: `שמש זרה מציירת צללים,\nקולות של שנאה, עיניים בלי שם.\nהפה כבר יבש, ננשכו המילים,\nוהעולם בחוץ, ממשיך ונושם.\n\nאי אפשר לעצור את הזמן,\nהוא הולך, מתקתק, פועם וממשיך.\nימים חולפים, ואין גם סימן,\nשיש פעוט. או גם ילד. שיש אור. לא מחשיך.\n\nלוחם קטן עוד שומר על תינוק,\nאך ילדים הם לא חומה.\nנדם הבכי, נתלש קול הצחוק,\nשער מזדקן, מאדים בדממה.\n\nפזמון א':\nאחים של דמעה,\nמחכים לי בקצה החדר.\nאחים שלא חזרו בשום פעימה,\nרק מקווים שיהיה בסדר.\n\nמלחמות בלי ברזל, חרבות בצינוק,\nאך ילדים לא נועדו להיכנע.\nמכווץ עיניים ילד, מרים ת'תינוק,\nמנסה לשרוד, זועק בתחינה.\n\nואבא שבשמיים עוצר את הזמן,\nויוצאת התקווה, צבועה בכתום.\nוהם נמשכים מעלה, מקבלים קצת סימן,\nשנשאר רק עוד קצת עד שיצאו בפתאום.\n\nשמש מוכרת מציירת צללים,\nקולות אנחה על שניים שחזרו,\nהפה מודה, אומר תהילים,\nוהלב יודע שהתפילות הם שעזרו.\n\nפזמון ב':\nאחים של אמונה בוערת,\nמחכים לי במסדרון.\nאחים שעם תפילה אחת מוארת,\nיוחזרו כדורון.`,
        audioLink: './audio/bibas.mp3',
        imageLink: './img/cfir_ariel.jpg',
        returned: true,
        returned2: true,
        died: true,
        returnDate: '22/02/2025'

    },
    {
        hostageName: 'אלקנה בוחבוט',
        description: 'אלקנה בוחבוט, בן 35, תושב מבשרת ציון, נחטף ב-7 באוקטובר 2024 במהלך מסיבת נובה ברעים, שבה היה חלק מצוות ההפקה. במהלך המתקפה, הוא סייע בטיפול ובפינוי הפצועים, ובשלב מאוחר יותר נלקח בשבי. אלקנה נשוי לרבקה, ולשניים ילד בן 4. הוא סובל מאסתמה, ומוחזק במנהרה בעומק של כ-30 מטר מתחת לאדמה, בתנאים קשים הכוללים טחב המכביד על נשימתו. למרות זאת, הוא שומר על שגרה יהודית בשבי, כולל קידוש בשישי וצום ביום כיפור. בנוסף, הוא ביקש להעביר לאשתו ולבנו את השיר "לוחמת" של אייל גולן, כדי שישמעו אותו בכל יום. ',
        lyrics: `
בִּמְקוֹם לְהַצִּיל אֶת עַצְמוֹ
הוּא נִשְׁאַר לְסַיֵּעַ לַאֲחֵרִים
לְהַצִּיל כַּמָּה שֶׁאֶפְשָׁר
לְטַפֵּל וּלְפַנּוֹת פְּצוּעִים

בַּשֶּׁבִי שׁוֹמֵר עַל שִׁגְרָה יְהוּדִית
תְּפִלּוֹת, שַׁבָּתוֹת וְחַגִּים
מַקְפִּיד עַל קִדּוּשׁ מִדֵּי שַׁבָּת
וְצָם בְּיוֹם הַכִּפּוּרִים

כֻּלָּנוּ מְחַכִּים לְךָ מְאֹד,
מִתְפַּלְּלִים וְלֹא מַרְפִּים
יוֹדְעִים שֶׁתָּשׁוּב בְּקָרוֹב
אֶת הַתִּקְוָה לֹא מְאַבְּדִים`,
        audioLink: './audio/elkana.mp3',
        imageLink: './img/elkana.jpg',
        returned: false,
        returnDate: null
    },
    {
        hostageName: 'אביתר דוד',
        description: 'אביתר דוד, בן 23, תושב כפר סבא, נחטף ב-7 באוקטובר 2024 במהלך מסיבת נובה ברעים, שבה היה עם חבריו גיא גלבוע-דלאל, רון צרפתי ז"ל ועידן הרמתי ז"ל, שנרצחו במתקפה. לאחר המתקפה, אביתר וגיא נלקחו בשבי. אביתר הוא אדם רגיש, בעל יכולת הקשבה ותובנות עמוקות, עם נטייה לעזור לחבריו בתקופות קשות. הוא אוהב לנגן בגיטרה, עוסק במשחקי מחשב, התעמלות קרקע ומכשירים, ועקשן מאוד כאשר הוא מחליט על מטרה. ',
        lyrics: `אֶבְיָתָר הוּא אוֹר נֶחְבָּא
כְּשֶׁזְּקוּקִים תָּמִיד הוּא בָּא
עִם לֵב גָּדוֹל וּנְשָׁמָה
נֶחְטַף לְמִנְהֲרוֹת אֲדָמָה

לְאֶבְיָתָר יֵשׁ מַנְגִּינָה
יֵשׁ חַיִּים שֶׁל נְתִינָה
הוּא אוֹהֵב וְהוּא אָהוּב
מִתְפַּלְּלִים שֶׁהוּא יָשׁוּב

וְעוֹד יַגִּיעַ יוֹם
הוּא יַגִּיעַ הַיּוֹם
שֶׁבַּקָּשׁוֹת יִשָּׁמְעוּ בַּמָּרוֹם
וְתָשׁוּבוּ הַבַּיְתָה בְּשָׁלוֹם.`,
        audioLink: './audio/evyatar.mp3',
        imageLink: './img/evyatar.jpg',
        returned: false,
        returnDate: null
    },

]

window.onload = () => {
    let container = document.getElementById("hostages-container");

    hostages.forEach(hostage => {
        let mainDiv = document.createElement("div");
        mainDiv.className = "hostage-card";
        if (hostage.died)
            mainDiv.className += " died";

        if (hostage.returned) {
            mainDiv.classList.add("returned-hostage"); // עיצוב ייחודי
        }

        mainDiv.onclick = () => { openDetails(hostage) };

        let div2 = document.createElement("div");
        div2.className = "icon";
        div2.innerHTML = hostage.returned ? "❤️" : "🎗️"; // החלפת אייקון
        if (hostage.died == true) {
            div2.innerHTML = "💔"
            div2.style.color = "red";
        }
        else if (hostage.returned && hostage.returned2 === false)
            div2.innerHTML = "🎗️❤️";

        let img = document.createElement("img");
        img.src = hostage.imageLink;
        img.className = "hostage-image";
        img.alt = hostage.hostageName;

        let h3 = document.createElement("h3");
        h3.textContent = hostage.hostageName;
        h3.dir = "rtl";

        let span = document.createElement("span");
        span.className = "hear";
        span.textContent = "לשמיעת השיר";

        let i = document.createElement("i")
        i.className = "fas fa-play-circle hear";
        i.dir = "rtl";

        mainDiv.appendChild(div2);
        mainDiv.appendChild(img);
        mainDiv.appendChild(h3);

        if (hostage.died) {
            let diedText = document.createElement("p");
            diedText.className = "died-text";
            diedText.textContent = "זכרם בליבנו לנצח 🕯️";
            diedText.dir = "rtl";
            mainDiv.appendChild(diedText);
        }
        else if (hostage.returned) {
            let returnedText = document.createElement("p");
            returnedText.className = "returned-text";
            returnedText.textContent = " חזר אלינו הביתה!";
            if (hostage.returned && hostage.returned2 === false)
                returnedText.textContent = "יאיר חזר אלינו הביתה!";
            returnedText.dir = "rtl";
            mainDiv.appendChild(returnedText);
        }

        mainDiv.appendChild(span);
        mainDiv.appendChild(i);
        container.appendChild(mainDiv);
    });

}
function openDetails(hostage) {
    text = hostage.lyrics.replace(/__OPEN__/g, '[').replace(/__CLOSE__/g, ']');
    document.getElementById("modalImage").src = hostage.imageLink
    document.getElementById('modalTitle').innerText = hostage.hostageName;
    document.getElementById('description').innerText = hostage.description;
    if (hostage.returned == true && hostage.returned2 == false) {
        var parts = hostage.hostageName.split(" ");
        if (parts.length > 1) {
            // var lastName = parts[1];
            var lastName = parts[1].substring(1);
            // return firstName + " " + newLastName;
            // console.log(lastName);
            if (hostage.died)
                document.getElementById('description').innerText += `\n 💔${lastName}   הוחזרו בתאריך ${hostage.returnDate}💔`
            else
                document.getElementById('description').innerText += `\n 💛${lastName}   חזר בתאריך ${hostage.returnDate}💛`
            document.getElementById("modalImage").className += 'returnImg'
            document.getElementById('modalTitle').innerText = hostage.hostageName + " , " + lastName + " חזר הביתה";

        }

    }
    else if (hostage.returned == true) {
        document.getElementById("modalImage").className += 'returnImg'
        if (hostage.died) {
            const messages = [
                hostage.hostageName + ", הלב שבור 💔",
                hostage.hostageName + ", חסרים לנו כל כך 😢",
                hostage.hostageName + ", תמיד בכאב 🖤",
                hostage.hostageName + ", כל כך כואב לנו 😔",
                hostage.hostageName + ", נשמות טהורות, לא נשכח 🕊️",
                hostage.hostageName + ", געגועים אינסופיים 😞",
                hostage.hostageName + ", לא מצליחים להפסיק לבכות 😭",
                hostage.hostageName + ", כל כך קשה להאמין 💔"
            ];
            document.getElementById('modalTitle').innerText = messages[Math.floor(Math.random() * messages.length)];
            document.getElementById('description').innerText += `\n 💔${hostage.hostageName}   הוחזרו בתאריך ${hostage.returnDate}💔`
        }
        else {
            document.getElementById('description').innerText += `\n💛 חזר בתאריך ${hostage.returnDate}💛`
            document.getElementById('modalTitle').innerText = hostage.hostageName + ", חזר הביתה";

        }

    }
    document.getElementById('btn').onclick = () => {
        copySong(text)
    };
    document.getElementById('modalText').innerHTML = text.replace(/\n/g, '<br>');
    if (hostage.audioLink === '***') {
        document.getElementById('modalAudio').style.opacity = '0';
        document.getElementById('notExist').innerHTML = 'השיר לא נוצר עדיין בmp3. אולי את/ה תתנדב/י ליצור אותו?'

    }
    else
        document.getElementById('modalAudio').src = hostage.audioLink;

    // if (hostage.returned)
    //     document.getElementById('modalTitle').innerText = hostage.hostageName + ", חזר הביתה";

    var downloadBtn = document.getElementById('downloadBtn');
    downloadBtn.addEventListener('click', function () {

        if (hostage.audioLink) {
            var link = document.createElement('a');
            link.href = hostage.audioLink;
            link.download = hostage.name + '.mp3';
            document.body.appendChild(link);
            link.click();
            document.body.removeChild(link);
        } else {
            alert("אין קובץ להורדה.");
        }
    });
    document.getElementById('detailsModal').style.display = 'block';
}
function copySong() {
    const textToCopy = document.getElementById('modalText').innerText;
    navigator.clipboard.writeText(textToCopy)
        .then(() => {
            const btn = document.getElementById("btn");
            const originalText = btn.innerHTML;
            btn.innerHTML = "!!הועתק בהצלחה";

            setTimeout(() => {
                btn.innerHTML = originalText;
            }, 2000);
            // document.getElementById("btn").innerHTML+=""
            // alert("מילות השיר הועתקו בהצלחה!");
        })
        .catch(err => {
            console.error('שגיאה בהעתקת הטקסט: ', err);
        });
}
function closeModal() {
    document.getElementById('modalAudio').style.opacity = '1';
    document.getElementById("modalImage").classList.remove("returnImg");
    document.getElementById('notExist').innerHTML = ''
    document.getElementById('detailsModal').style.display = 'none';
    document.getElementById('modalAudio').pause();
    document.getElementById('modalAudio').currentTime = 0;
}
